class Script(object):
    START_TXT = """𝗛𝗲𝗹𝗹𝗼 {},
𝗠𝘆 𝗻𝗮𝗺𝗲 𝗶𝘀  <a href=https://t.me/{}>{}</a>!
ഞാൻ ഒരു 𝐀𝐔𝐓𝐎-𝐅𝐈𝐋𝐓𝐄𝐑-𝐁𝐎𝐓 𖠌 ആണ്, എന്റെ മുതലാളി <a href='https://t.me/AKLucashood'>༒ 🄰🄺🅅 666 ༒🕊️⃟࿐</a> ആണ്, നിങ്ങൾക്ക് ബിരിയാണി വേണോ..."""

    HELP_TXT = """Hey {}
<b>Here Is The Help For My Commands.</b>"""

    ABOUT_TXT = """
╭━━━━━━━━━━━━━━━━━━━━━➣ 
┣⪼  ᴍʏ ɴᴀᴍᴇ: {}
┣⪼ ᴄʀᴇᴀᴛᴏʀ: <a href='https://t.me/AKLucashood'>༒ 🄰🄺🅅 666 ༒🕊️⃟࿐</a>
┣⪼ Dev 2  :<a href='https://t.me/ToxicboymX'>🅃🄾🅇🄸🄲 ⒷⓄⓎ🕊️⃟࿐</a>
┣⪼ ʟɪʙʀᴀʀʏ: <a href='https://docs.pyrogram.org/'>Pyrogram</a>
┣⪼ 𝚁𝚎𝚙𝚘: <a href='https://t.me/AkvMovieHub'>ᴄʟɪᴄᴋ</a>
┣⪼ ᴅᴀᴛᴀ ʙᴀꜱᴇ: <a href='https://t.me/AkvMovieHub'>Private DB</a>
┣⪼ 𖠌ʙᴏᴛ ꜱᴇʀᴠᴇʀ: <a href='https://t.me/AkvMovieHub'>Private Server</a>
┣⪼ ʙᴜɪʟᴅ ꜱᴛᴀᴛᴜꜱ: v2.0.1 [ Beta ]
╰━━━━━━━━━━━━━━━━━━━━━➣╚══════════════════❍⊱❁۪۪



🔖 𝑸𝒖𝒐𝒕𝒆 : ആരും പേടിക്കേണ്ട എല്ലാവർക്കും കിട്ടും ™️"""
    
